#### 결측치 제거 및 그룹 합계에서 조건에 맞는 값 찾아 출력
주어진 데이터 중 basic1.csv에서 'f1'컬럼 결측 데이터를 제거하고, 'city'와 'f2'을 기준으로 묶어 합계를 구하고, 'city가 경기이면서 f2가 0'인 조건에 만족하는 f1 값을 구하시오
- 데이터셋 : basic1.csv

In [1]:
import os 
from os.path import join

import pandas as pd
import numpy as np

In [38]:
file_Nm = join('data', 'basic1.csv')
df = pd.read_csv(file_Nm)
df.head(3)

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986

In [46]:
# f1컬럼 결측 데이터를 제거
df = df[~df['f1'].isnull()]
df.head()

     id   age city    f1  f2   f3    f4         f5
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869
5  id06  22.0   서울  57.0   0  vip  INTP  20.129444
6  id07  36.3   서울  60.0   1  NaN  ISFJ   9.796378

In [60]:
# 방법1
# city와 f2를 기준으로 합계
df = df.groupby(['city', 'f2']).sum().reset_index()
df

# city가 경기이면서 f2가 0'인 조건에 만족하는 f1
print(df[(df['city'] == '경기')&(df['f2'] == 0)]['f1'])

0    833.0
Name: f1, dtype: float64

In [68]:
# 방법2
df = df.groupby(['city', 'f2']).sum()
df
df.iloc[0]['f1']

833.0